Repository: Pierre-Lannoy/wp-device-detector
Catalog: .translations/wp-plugins-device-detector-stable-readme-*.po
Languages: fr

source: Full featured analytics reporting and management tool that detects all devices accessing your WordPress site.
fr: Outil complet de rapports statistiques et de détection de tous les appareils accédant à votre site WordPress.

source: For a full help on WP-CLI commands in Device Detector, please <a href="https://github.com/Pierre-Lannoy/wp-device-detector/blob/master/WP-CLI.md">read this guide</a>.
fr: Pour obtenir une aide complète sur les commandes WP-CLI dans Device Detector, veuillez <a href="https://github.com/Pierre-Lannoy/wp-device-detector/blob/master/WP-CLI.md">lire ce guide</a>.

source: <strong>Device Detector</strong> supports an extensive set of WP-CLI commands to:
fr: <strong>Device Detector</strong> prend en charge un vaste ensemble de commandes WP-CLI pour :

source: display devices statistics: see <code>wp help device analytics</code> for details.
fr: afficher les statistiques relatives aux périphériques : voir <code>wp help device analytics</code> pour plus de détails.

source: describe engine capacities: see <code>wp help device engine</code> for details;
fr: décrire les capacités du moteur : voir <code>wp help device engine</code> pour plus de détails ;

source: toggle on/off main settings: see <code>wp help device settings</code> for details;
fr: activer ou désactiver le réglages principaux - voir <code>wp help device settings</code> pour plus de détails ;

source: display Device Detector status: see <code>wp help device status</code> for details;
fr: afficher l’état de Device Detector : voir <code>wp help device status</code> pour plus de détails ;

source: get a device detail: see <code>wp help device describe</code> for details;
fr: obtenir des informations relatives à un périphérique : voir <code>wp help device describe</code> pour plus de détails ;

source: This plugin may handle personally identifiable information (PII). If the GDPR or CCPA or similar regulation applies to your case, you must adapt your processes (consent management, security measure, treatment register, etc.).
fr: Cette extension peut traiter des données à caractère personnel (DCP). Si le RGPD ou le CCPA ou un règlement similaire s’applique à votre cas, vous devez adapter vos processus (gestion du consentement, mesure de sécurité, registre des traitements, etc.).

source: This plugin doesn't set any cookie in the user's browser.
fr: Cette extension ne dépose pas de cookie dans le navigateur de l’utilisatrice ou de l’utilisateur.

source: This plugin, as any piece of software, is neither compliant nor non-compliant with privacy laws and regulations. It is your responsibility to use it - by activating the corresponding options or services - with respect for the personal data of your users and applicable laws.
fr: Cette extension, comme tout autre logiciel, n’est ni conforme ni non conforme aux lois et règlements sur la protection de la vie privée. Il est de votre responsabilité de l’utiliser - en activant les options ou services correspondants - dans le respect des données personnelles de vos utilisatrices et utilisateurs ainsi que des lois applicables.

source: Privacy
fr: Confidentialité

source: You can report bugs and suggest ideas via the <a href="https://github.com/Pierre-Lannoy/wp-device-detector/issues">GitHub issue tracker</a> of the plugin.
fr: Vous pouvez signaler des bogues et suggérer des améliorations via le <a href="https://github.com/Pierre-Lannoy/wp-device-detector/issues">suivi d’incidents GitHub</a> de l’extension.

source: Developer's documentation can be found in the <a href="https://github.com/Pierre-Lannoy/wp-device-detector">GitHub repository</a> of the plugin.
fr: Vous trouverez la documentation du développeur sur le <a href="https://github.com/Pierre-Lannoy/wp-device-detector/">dépôt GitHub</a> de l’extension.

source: Support is provided via the official <a href="https://wordpress.org/support/plugin/device-detector/">WordPress page</a>.
fr: L’assistance est proposée via la page officielle <a href="https://wordpress.org/support/plugin/device-detector/">d’assistance</a>.

source: Yes. It is designed to work on multisite too. Network Admins can configure the plugin and have access to all analytics. Sites Admins have access to the analytics of their site(s) and can configure options for their own site(s).
fr: Oui. Cette extension est conçue pour fonctionner sur un multisite aussi. Les administratrices et administrateurs du réseau peuvent configurer l’extension et avoir accès à tous les statistiques. Les administratrices et administrateurs de sites ont juste accès aux statistiques de leurs sites et peuvent configurer l’extension pour leurs propres sites.

source: You need at least <strong>WordPress 5.2</strong> and <strong>PHP 7.2</strong>.
fr: Vous avez besoin d’au moins <strong>WordPress 5.2</strong> et <strong>PHP 7.2</strong>.

source: Where can I report a bug?
fr: Où puis-je signaler un bogue ?

source: Where can I find documentation?
fr: Où puis-je trouver la documentation ?

source: Where can I get support?
fr: Où puis-je obtenir de l’aide ?

source: Can this plugin work on multisite?
fr: Cette extension fonctionne-t’elle sur un multisite ?

source: What are the requirements for this plugin to work?
fr: Quels sont les prérequis pour que cette extension fonctionne ?

source: Enjoy!
fr: Profitez !

source: Visit 'Settings &gt; Device Detector' in the left-hand menu of your WP Admin to adjust settings.
fr: Visitez « Réglages &gt; Device Detector » dans le menu gauche de votre panneau d’administration pour ajuster les paramètres.

source: Activate Device Detector from your Plugins page.
fr: Activez Device Detector depuis votre page Extensions.

source: Upload the <code>device-detector</code> directory to your <code>/wp-content/plugins/</code> directory, using your favorite method (ftp, sftp, scp, etc...).
fr: Téléversez le dossier <code>Device-detector</code> dans votre dossier <code>/wp-content/plugins/</code>, en utilisant votre méthode préférée (ftp, sftp, scp, etc.).

source: Download Device Detector.
fr: Téléchargez Device Detector.

source: Activate Device Detector.
fr: Activez Device Detector.

source: Click on the 'Install Now' button.
fr: Cliquez sur le bouton « Installer maintenant ».

source: Search for 'Device Detector'.
fr: Recherchez 'Device Detector'.

source: Visit 'Plugins &gt; Add New'.
fr: Visitez « Extensions &gt; Ajouter ».

source: Once Activated
fr: Une fois activé

source: From WordPress.org
fr: Depuis WordPress.org

source: From your WordPress dashboard
fr: Depuis votre Tableau de bord WordPress

source: If you like this plugin or find it useful and want to thank me for the work done, please consider making a donation to <a href="https://www.laquadrature.net/en">La Quadrature Du Net</a> or the <a href="https://www.eff.org/">Electronic Frontier Foundation</a> which are advocacy groups defending the rights and freedoms of citizens on the Internet. By supporting them, you help the daily actions they perform to defend our fundamental freedoms!
fr: Si vous aimez cette extension ou la trouvez utile et que vous voulez me remercier pour le travail accompli, vous pouvez faire un don à <a href="https://www.laquadrature.net/en">La Quadrature Du Net</a> ou l’<a href="https://www.eff.org/">Electronic Frontier Foundation</a> qui sont des associations de défense des droits et libertés des citoyens sur Internet. En les soutenant, vous aidez les actions quotidiennes qu’ils accomplissent pour défendre nos libertés fondamentales !

source: Anyway, I'll be glad to help you if you encounter issues when using this plugin. Just use the support section of this plugin page.
fr: Dans tous les cas, je serai heureux de vous apporter mon assistance si vous rencontrez des problèmes lors de l’utilisation de cette extension. Merci de me contacter via la page support de ce site.

source: This plugin is free and provided without warranty of any kind. Use it at your own risk, I'm not responsible for any improper use of this plugin, nor for any damage it might cause to your site. Always backup all your data before installing a new plugin.
fr: Cette extension est gratuite et distribuée sans aucune garantie d’aucune sorte. Son utilisation se fait à vos risques et périls, je ne saurais être tenu responsable d’aucun dommage que son utilisation pourrait causer à votre site. Pensez à toujours sauvegarder vos données avant d’installer une nouvelle extension.

source: If you're a plugins / themes developer and want to take advantage of the detection features of Device Detector, visit the <a href="https://github.com/Pierre-Lannoy/wp-device-detector">GitHub repository</a> of the plugin to learn how to use it.
fr: Si vous êtes un développeur d’extensions ou thèmes et que vous souhaitez profiter des fonctionnalités de détection de Device Detector, visitez le <a href="https://github.com/Pierre-Lannoy/wp-device-detector">dépôt GitHub</a> de l’extension pour découvrir comment l’utiliser.

source: Based on the amazing <a href="https://github.com/matomo-org/matomo">Matomo</a> UDD, Device Detector is a free and open source plugin for WordPress. It integrates many other free and open source works (as-is or modified). Please, see 'about' tab in the plugin settings to see the details.
fr: Basé sur le fantastique UDD de <a href="https://github.com/matomo-org/matomo">Matomo</a>, Device Detector est une extension libre et open source pour WordPress. Elle intègre de nombreuses autres œuvres libres et open source (telles quelles ou modifiées). Consultez l’onglet « à propos » dans l’extension pour obtenir des détails.

source: <strong>Device Detector</strong> supports multisite report delegation and per site configuration (see FAQ).
fr: <strong>Device Detector</strong> prend en charge la délégation de rapports multisites et le réglages différencié par site (voir FAQ).

source: For a full list of items, characteristics and supported devices, please see the 'devices' tab in the plugin settings.
fr: Pour une liste complète des éléments, des caractéristiques et des périphériques pris en charge, veuillez consulter l’onglet « appareils » dans les paramètres de l’extension.

source: <strong>Device Detector</strong> can report the following main items and characteristics:
fr: <strong>Device Detector</strong> peut rendre compte des caractéristiques et éléments principaux suivants :

source: For each call made to your site, <strong>Device Detector</strong> analyzes the sent header, detects the device doing the call (and its characteristics) and can:
fr: Pour chaque appel effectué sur votre site, <strong>Device Detector</strong> analyse l’en-tête envoyé, détecte l’appareil effectuant l’appel (et ses caractéristiques) et peut :

source: <strong>Device Detector</strong> is a full featured analytics reporting and management tool that detects all devices accessing your WordPress site.
fr: <strong>Device Detector</strong> est un outil complet de rapports statistiques et de détection de tous les appareils accédant à votre site WordPress.

source: Calling channel: site backend, site frontend, cron job, Ajax request, XML-RPC request, Rest API request, Atom/RDF/RSS feed;
fr: Canaux : interface d’administration du site, interface publique du site, tâches planifiées, requêtes Ajax, requêtes XML-RPC, requêtes API, flux Atom/RDF/RSS ;

source: OS identification: name, version, etc.;
fr: Identification du système d’exploitation : nom, version, etc. ;

source: Device identification: brand, model, etc.;
fr: Identification de l’appareil : marque, modèle, etc. ;

source: Technical characteristics and versions of all browsers;
fr: Caractéristiques techniques et versions de tous les navigateurs ;

source: Client types: Application Library, Browser, Feed Reader, Media Player, Mobile Application, PIM.
fr: Types de clients : bibliothèque d’applications, navigateur, lecteur de flux, lecteur multimédia, application mobile, PIM.

source: Devices types: Camera, Car Browser, Console, Feature Phone, Phablet, Portable Media Player, Smart Display, Smartphone, Tablet, TV;
fr: Types d’appareils : appareil photo, navigateur de voiture, console, téléphone , phablet, lecteur multimédia portable, afficheur intelligent, smartphone, tablette, TV ;

source: Classes: Bot, Desktop, Mobile and Other;
fr: Classes : robot, ordinateur de bureau, mobile et autre ;

source: KPIs: number of hits, class breakdown, clients types and engines;
fr: KPiIs : nombre d’occurrences, répartition par classe, types et moteur des clients ;

source: record detected characteristics for reporting.
fr: enregistrer les caractéristiques détectées dans des rapports.

source: let you use the result of the detection in your own developments;
fr: vous laisser utiliser le résultat de la détection dans vos propres développements ;

source: add some CSS classes to the <code>body</code> tag of your site (many classes to choose from);
fr: ajouter quelques classes CSS au tag <code>body</code> de votre site (grand choix de classes) ;

source: modify the <code>is_mobile()</code> WordPress core function to be more precise and reliable;
fr: modifier la fonction WordPress <code>is_mobile()</code> pour la rendre plus précise et fiable ;

source: Donation
fr: Don

source: Support
fr: Assistance

source: Developers
fr: Développeurs

source: Device Details
fr: Détails de l’appareil

source: Devices List
fr: Liste des appareils

source: OS Details
fr: Détails de l’OS

source: OS List
fr: Liste des OS

source: Libraries List
fr: Liste des bibliothèques

source: Bot Details
fr: Détails du robot

source: Bots List
fr: Liste des robots

source: Browser Details
fr: Détails du navigateur

source: Browsers List
fr: Liste des navigateurs

source: Main Analytics Dashboard
fr: Tableau de bord principal

source: Please, see <a href="https://github.com/Pierre-Lannoy/wp-device-detector/blob/master/CHANGELOG.md">full changelog</a> on GitHub.
fr: Merci de consulter le <a href="https://github.com/Pierre-Lannoy/wp-device-detector/blob/master/CHANGELOG.md">journal des modifications</a> sur GitHub.
